In [1]:
import pandas as pd 
import seaborn as srn
import statistics as sts 
#importar dados
dataset = pd.read_csv("C:\CIENCIAS_DE_DADOS\DADOS\DADOS_TESTE\Churn.csv", sep=";") 
#visualizar
dataset.head()

   X0   X1  X2        X3  X4  X4.1        X6  X7  X8  X9         X10  X11
0   1  619  RS  Feminino  42     2         0   1   1   1  10134888.0    1
1   2  608  SC  Feminino  41     1   8380786   1   0   1  11254258.0    0
2   3  502  RS  Feminino  42     8   1596608   3   1   0  11393157.0    1
3   4  699  RS  Feminino  39     1         0   2   0   0   9382663.0    0
4   5  850  SC  Feminino  43     2  12551082   1   1   1    790841.0    0

In [ ]:
#tamanho dos corpos dos dados
dataset.shape

In [ ]:
#Escreve os nomes da coluna de acordo do conhecimento do dado
dataset.columns = ["Id","Score","Estado","Genero","Idade","Patrimonio","Saldo","Produtos","TemCartCredito",
                    "Ativo","Salario","Saiu" ]
dataset.head()

In [ ]:
agrupado = dataset.groupby(['Salario']).size()
agrupado

In [ ]:
agrupado.plot.bar(color = 'blue')

In [ ]:
agrupado = dataset.groupby(['Salario']).size()
agrupado

In [ ]:
agrupado.plot.bar(color = 'red')

In [ ]:
#explorar colunas n√∫mericas
dataset['Quantidade Distinta de Produtos'].describe()

In [ ]:
srn.boxplot(dataset['Salario']).set_title('teste')

In [ ]:
srn.displot(dataset['Salario'])

In [ ]:
dataset.isnull().sum()

In [ ]:
#verifica a mediana 
median = sts.median(dataset['Salario'])
median

In [ ]:
#Substituir NAN por Mediana
dataset['Salario'].fillna(median, inplace=True)